read_verilog -formal spi-master.v
prep -top top -nordff
clk2fflogic; opt_clean
write_smt2 -wires spi-master.smt2
